In [1]:
import pandas as pd

In [2]:
ch = pd.read_table('http://bit.ly/chiporders')
ch.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [3]:
hard = pd.read_table('http://bit.ly/movieusers')
hard.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [5]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
harder = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)
harder.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [64]:
ufo = pd.read_table('http://bit.ly/uforeports', sep=',') #because this is a CSV we could use read_CSV and take off sep+

In [65]:
type(ufo)

pandas.core.frame.DataFrame

In [66]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [67]:
ufo['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [68]:
type(ufo['City']) #OR you can use the below dot . series

pandas.core.series.Series

In [69]:
ufo.City.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [70]:
ufo['Colors Reported'].head()

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Colors Reported, dtype: object

In [71]:
'ab' + 'cd'

'abcd'

In [72]:
ufo['Location'] = ufo.City +" " +ufo.State

In [73]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair NY

In [74]:
movie = pd.read_csv('http://bit.ly/imdbratings')

In [75]:
movie.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [76]:
movie.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [77]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 979 entries, 0 to 978
Data columns (total 6 columns):
star_rating       979 non-null float64
title             979 non-null object
content_rating    976 non-null object
genre             979 non-null object
duration          979 non-null int64
actors_list       979 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 46.0+ KB

In [78]:
movie.shape

(979, 6)

In [79]:
movie.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [80]:
type(movie)

pandas.core.frame.DataFrame

In [81]:
movie.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [50]:
ufos = pd.read_csv('http://bit.ly/uforeports')

In [51]:
ufos.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [52]:
ufos.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [53]:
ufos.rename(columns={'Colors Reported':'colors_reported','Shape Reported':'shape_reported'}, inplace=True)
ufos.head()

                   City colors_reported shape_reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [58]:
ufos_cols= ['city', 'colorsrep', 'shprep', 'state', 'time']

In [59]:
ufos.columns = ufo_cols
ufos.head()

                   city colorsrep    shprep state             time
0                Ithaca       NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro       NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke       NaN      OVAL    CO  2/15/1931 14:00
3               Abilene       NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair       NaN     LIGHT    NY  4/18/1933 19:00

In [61]:
ufos2 = pd.read_csv('http://bit.ly/uforeports', names=ufos_cols, header=0)
ufos2.head()

                   city colorsrep    shprep state             time
0                Ithaca       NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro       NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke       NaN      OVAL    CO  2/15/1931 14:00
3               Abilene       NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair       NaN     LIGHT    NY  4/18/1933 19:00

In [84]:
ufo.columns = ufo.columns.str.replace(' ','')
ufo.columns

Index(['City', 'ColorsReported', 'ShapeReported', 'State', 'Time', 'Location'], dtype='object')

## removing columns